tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "homebrew/services"
tap "schniz/tap"
tap "superfly/tap"
brew "ack"
brew "bat"
brew "chezmoi"
brew "cmake"
brew "deno"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "git", link: false
brew "sqlite"
brew "python@3.9"
brew "glib"
brew "go"
brew "highlight"
brew "imagemagick"
brew "kubernetes-cli"
brew "lazygit"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "moreutils"
brew "mysql", restart_service: true
brew "neovim"
brew "pdfcpu"
brew "pyenv"
brew "python@3.10"
brew "python@3.7"
brew "redis", restart_service: true
brew "ripgrep"
brew "subversion"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart"
cask "brave-browser"
cask "font-dm-mono"
cask "font-fira-code"
cask "font-new-york"
cask "font-roboto-mono"
cask "font-sf-mono-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "notion"
cask "qlmarkdown"
cask "raycast"
cask "switchkey"
cask "visual-studio-code"
cask "zeplin"
