tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "epk/epk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "homebrew/services"
tap "schniz/tap"
tap "thoughtbot/formulae"
brew "ack"
brew "autojump"
brew "bat"
brew "cmake"
brew "deno"
brew "fish"
brew "fnm"
brew "fzf"
brew "git", link: false
brew "go"
brew "highlight"
brew "kubernetes-cli"
brew "lazygit"
brew "openssl@1.1"
brew "luajit"
brew "moreutils"
brew "mysql", restart_service: true
brew "neovim"
brew "pcre"
brew "pdfcpu"
brew "pkg-config"
brew "pyenv"
brew "xz"
brew "python@3.7"
brew "ranger"
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watchman"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku"
cask "alacritty"
cask "android-studio"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-sf-mono-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "motrix"
cask "notion"
cask "qlcolorcode"
cask "qlmarkdown"
cask "spotify"
cask "squirrel"
cask "switchkey"
cask "visual-studio-code"
cask "zeplin"
cask "microsoft-edge"
